Autodesk.Revit.DB.Steel.SteelElementProperties.CountOfAsyncWarnings(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
returns the count of async warnings for this element
aDoc:
Revit document.
elemId:
The element for which we update warnings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Steel.SteelElementProperties.ClearWarnings(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Clears the async warnings for the element
aDoc:
Revit document.
elemId:
The element for which we update warnings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Steel.SteelElementProperties.FlushWarnings(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Boolean)
Updates the async warnings for the element
aDoc:
Revit document.
elemId:
The element for which we update warnings.
forceRebuildCache:
Force rebuild cache
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Steel.SteelElementProperties.FlushWarnings(Autodesk.Revit.DB.Document,System.Boolean)
Updates the async warnings for all the elements in the document
aDoc:
Revit document.
forceRebuildCache:
Force rebuild cache
Returns:
Returns a set with element ids that had their warnings flushed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Steel.SteelElementProperties.GetCurrWarnings(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList{Autodesk.Revit.DB.FailureDefinitionId}@)
aDoc:
The document.
elemId:
The element for which we query warnings.
warnings:
The warnings currently associated to this element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Steel.SteelElementProperties.RemoveWarning(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.FailureDefinitionId)
aDoc:
Revit document.
elemId:
The element for which we remove a warning.
warn:
The warning to be removed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Steel.SteelElementProperties.PostWarning(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.FailureDefinitionId)
aDoc:
Revit document.
elemId:
The element for which we add a warning.
warn:
The warning to be added.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Steel.SteelElementProperties.RegisterMaterial(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.String)
Registers entry in maps
aDoc:
Current document.
revitMaterialId:
Id of the Revit material.
extMaterial:
External material
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Steel.SteelElementProperties.RemoveLink(Autodesk.Revit.DB.Document,System.Guid)
Removes an entry from the maps.
aDoc:
Current document.
guid:
GUID of the element to be removed from the maps.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Steel.SteelElementProperties.RemoveLink(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Removes an entry from the maps.
aDoc:
Current document.
elemId:
Revit Id of the element to be removed from the maps.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Steel.SteelElementProperties.GetAllExternalIds(Autodesk.Revit.DB.Document)
Returns all the guids of the external elements linked to Revit elements.
aDoc:
Current document.
Returns:
guids of the external elements.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Steel.SteelElementProperties.GetAllRevitMaterialsIds(Autodesk.Revit.DB.Document)
Returns all the ids of the Revit materials of external elements.
aDoc:
Current document.
Returns:
Element ids of the Revit materials.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Steel.SteelElementProperties.GetRevitBuiltInCategory(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Int32)
Returns id of the Revit material taking as input external material name.
aDoc:
Current document.
elementId:
Element id of the Revit element.
subelementKey:
Subelement key of the element's subelement
Returns:
Element id of the Revit builtin category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Steel.SteelElementProperties.GetRevitMaterialId(Autodesk.Revit.DB.Document,System.String)
Returns id of the Revit material taking as input external material name.
aDoc:
Current document.
mat:
name of the external material.
Returns:
Element id of the Revit material.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Steel.SteelElementProperties.GetExternalMaterial(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Returns name of the external material taking as input Revit material id.
aDoc:
Current document.
id:
Element id of the Revit material.
Returns:
name of the external material.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Steel.SteelElementProperties.GetExternalId(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Returns guid of the external element taking as input Revit element id.
aDoc:
Current document.
id:
Element id of the Revit element.
Returns:
guid of the external element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Steel.SteelElementProperties.GetRevitId(Autodesk.Revit.DB.Document,System.Guid)
Returns Revit element id taking as input an external guid.
aDoc:
Current document.
guid:
guid of the external element.
Returns:
Element id of the Revit element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Steel.SteelElementProperties.RemoveFromElement(Autodesk.Revit.DB.Element)
Removes the element's SteelElementCell.
Returns:
returns true if succeeded
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Steel.SteelElementProperties.AddToElement(Autodesk.Revit.DB.Element,System.Guid,System.Boolean)
Create a SteelElementCell on element and adds the ext object id to it.
Returns:
Returns true if succeeded.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Steel.SteelElementProperties.CanHaveCell(Autodesk.Revit.DB.Element)
Validates that pElement is a beam or column that has a usable profile, a StructuraConnectionHandler or an SteelElement.
Returns:
True if pElement is a valid FamilyInstance representing framing element, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Steel.SteelElementProperties.UpdateExternalUniqueIdsAfterPaste(System.Collections.Generic.IDictionary{System.Guid,System.Guid})
Updates members external unique ids according to the copy paste map
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Steel.SteelElementProperties.AddFabricationInformationForRevitElements(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId})
This method adds fabrication information to the given elements.
Remarks:
You can add fabrication information to connections, beams, columns, braces, walls, floors and foundations.
aDoc:
Document containing the given elements ids.
elementIds:
Ids of the elements to which we want to add fabrication information.
Returns:
Ids of the elements for which we couldn't add fabrication information.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Steel.SteelElementProperties.GetReference(Autodesk.Revit.DB.Document,System.Guid)
This method will return the reference for the given fabrication id.
aDoc:
Document in which to search for the reference.
guid:
The fabrication id for which a reference is required.
Returns:
The reference to the element or subelement corresponding to the given id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Steel.SteelElementProperties.GetFabricationUniqueID(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Reference)
This method will return the fabrication id for the given reference.
aDoc:
Document to which the reference belongs.
reference:
The reference to the element or subelement for which fabrication id is required.
Returns:
The fabrication id of the element or subelement for this reference, if it has fabrication information attached, or an Guid.Empty otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.DB.Steel.SteelElementProperties.GetSteelElementProperties(Autodesk.Revit.DB.Element)
Get SteelElementProperties for the input element if they exist.
Remarks:
If the input element doesn't have steel informations than it retuns null.
pElement:
The element from which we try to obtain SteelElementProperties.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019